# CwpLinkedRoomParams Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpLinkedRoomParams Property
ParameterTypeId Class See Also
---
"Parameters"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpLinkedRoomParams { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpLinkedRoomParams As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpLinkedRoomParams {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace